{"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 38], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_ids"}, "name": "input_ids", "inbound_nodes": []}, {"class_name": "BertModelLayer", "config": {"name": "bert", "trainable": true, "dtype": "float32", "initializer_range": 0.02, "max_position_embeddings": 512, "hidden_size": 768, "embedding_size": null, "project_embeddings_with_bias": true, "vocab_size": 30522, "use_token_type": true, "use_position_embeddings": true, "token_type_vocab_size": 2, "hidden_dropout": 0.1, "extra_tokens_vocab_size": null, "project_position_embeddings": true, "mask_zero": false, "adapter_size": null, "adapter_activation": "gelu", "adapter_init_scale": 0.001, "num_heads": 12, "size_per_head": null, "query_activation": null, "key_activation": null, "value_activation": null, "attention_dropout": 0.1, "negative_infinity": -10000.0, "intermediate_size": 3072, "intermediate_activation": "gelu", "num_layers": 12, "out_layer_ndxs": null, "shared_layer": false}, "name": "bert", "inbound_nodes": [[["input_ids", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAUwAAAHMWAAAAfABkAGQAhQJkAWQAZACFAmYDGQBTACkCTukA\nAAAAqQApAdoDc2VxcgIAAAByAgAAAPofPGlweXRob24taW5wdXQtNTAtMmIzNmExZDhhZTM1PtoI\nPGxhbWJkYT4OAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_1", "inbound_nodes": [[["bert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 768, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 7, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}], "input_layers": [["input_ids", 0, 0]], "output_layers": [["dense_3", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}